lachlanhurst/nrf51_vesc/ssd1306.c
void ssd1306_set_textwrap(bool w)
{
    wrap = w;
}

uint8_t ssd1306_get_rotation(void)
{
    return rotation;
}

void ssd1306_set_rotation(uint8_t x)
{
    rotation = (x & 3);
    switch (rotation) {
    case 0:
    case 2:
        _width  = WIDTH;
        _height = HEIGHT;
        break;
    case 1:
    case 3:
        _width  = HEIGHT;
        _height = WIDTH;
        break;
    }
}

// Enable (or disable) Code Page 437-compatible charset.
// There was an error in glcdfont.c for the longest time -- one character
// (#176, the 'light shade' block) was missing -- this threw off the index
// of every character that followed it.  But a TON of code has been written
// with the erroneous character indices.  By default, the library uses the
// original 'wrong' behavior and old sketches will still work.  Pass 'true'
// to this function to use correct CP437 character values in your code.
void ssd1306_cp437(bool x)
{
    _cp437 = x;
}


void ssd1306_putstring(char* buffer)
{
    while (*buffer) {
        ssd1306_write((uint8_t)*buffer);
        buffer++;
    }
}

void ssd1306_puts(char* buffer)
{
    ssd1306_putstring(buffer);
    ssd1306_write('\n');
}





static bool ssd1306_send_cmd(uint8_t cmd) {
    ret_code_t err_code;

    uint8_t w2_data[2];

    w2_data[0] = 0x00;
    w2_data[1] = cmd;

    err_code = nrf_drv_twi_tx(&m_twi, SSD1306_ADDR, w2_data, sizeof(w2_data), false);
    APP_ERROR_CHECK(err_code);
}

static bool ssd1306_send_data(uint8_t data) {
    ret_code_t err_code;

    uint8_t w2_data[2];

    w2_data[0] = 0x40;
    w2_data[1] = data;

    err_code = nrf_drv_twi_tx(&m_twi, SSD1306_ADDR, w2_data, 2, false);
    APP_ERROR_CHECK(err_code);
}

bool ssd1306_init() {
    ssd1306_send_cmd(0xAE);
    ssd1306_send_cmd(0xD5);
    ssd1306_send_cmd(0x80);
    ssd1306_send_cmd(0XA8);
    ssd1306_send_cmd(0x3F);
    ssd1306_send_cmd(0xD3);
    ssd1306_send_cmd(0x00);
    ssd1306_send_cmd(0x40 | 0x00);
    ssd1306_send_cmd(0x8D);
    ssd1306_send_cmd(0x14);
    ssd1306_send_cmd(0x20);
    ssd1306_send_cmd(0x00);
    ssd1306_send_cmd(0xA0 | 0x1);
    ssd1306_send_cmd(0xC8);
    ssd1306_send_cmd(0xDA);
    ssd1306_send_cmd(0x12);
    ssd1306_send_cmd(0x81);
    ssd1306_send_cmd(0x8F);
    ssd1306_send_cmd(0xD9);
    ssd1306_send_cmd(0xF1);
    ssd1306_send_cmd(0xDB);
    ssd1306_send_cmd(0x40);
    ssd1306_send_cmd(0xA4);
    ssd1306_send_cmd(0xA6);
    return ssd1306_send_cmd(0xAF);
}

void ssd1306_clear() {
    ssd1306_send_cmd(0x21); // set column start/end
    ssd1306_send_cmd(0);
    ssd1306_send_cmd(127);

    ssd1306_send_cmd(0x22); // set page start/end
    ssd1306_send_cmd(0);
    ssd1306_send_cmd(7);

    for (int i = 0; i < (SSD1306_WIDTH * SSD1306_HEIGHT)/8; i++) {
        ssd1306_send_data(0x00);
    }
}

void ssd1306_inverse(bool inverted) {
	if (inverted) {
        ssd1306_send_cmd(0xA7);
    } else {
        ssd1306_send_cmd(0xA6);
    }
}

void ssd1306_display() {

    ssd1306_send_cmd(0x21); // set column start/end
    ssd1306_send_cmd(0);
    ssd1306_send_cmd(127);

    ssd1306_send_cmd(0x22); // set page start/end
    ssd1306_send_cmd(0);
    ssd1306_send_cmd(7);

    uint8_t w2_data[SSD1306_BUFFER_PAGE_SIZE+1];
    uint8_t *p = &w2_data;
    p++;
    w2_data[0] = 0x40;

    uint8_t *bp = &buffer;
    for (int i = 0; i < (SSD1306_WIDTH * SSD1306_HEIGHT)/8; i=i+SSD1306_BUFFER_PAGE_SIZE) {
        //ssd1306_send_data(buffer[i]);
        memcpy(p, bp, SSD1306_BUFFER_PAGE_SIZE);

        nrf_drv_twi_tx(&m_twi, SSD1306_ADDR, w2_data, SSD1306_BUFFER_PAGE_SIZE+1, false);

        bp=bp+SSD1306_BUFFER_PAGE_SIZE;
    }

}

/**
 * @brief TWI initialization.
 */
void twi_init(void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_lm75b_config = {
       .scl                = SSD1306_SCL,
       .sda                = SSD1306_SDA,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_lm75b_config, NULL, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);
}
